cases/06_wave_turbine/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//

dynamicFvMesh       dynamicOversetFvMesh;

motionSolver        rigidBodyMotion;

motionSolverLibs
(
    rigidBodyMeshMotion
    "librigidBodyMooring.so"
    "libOF2.so"
);

rigidBodyMotionCoeffs
{
    report          on;

    solver
    {
        type        Newmark;
    }

    accelerationRelaxation  0.2;
    accelerationDamping     1.0;

    bodies
    {
        platformBody
        {
            type            rigidBody;
            parent          root;

            centreOfMass    (6.1468 0 -13.4286);
            mass            1.3473e7;
            inertia         (6.827e9 0 0 6.827e9 0 1.226e10);

            transform       (1 0 0 0 1 0 0 0 1) (0 0 0);

            joint           { type floating; }   // full 6-DOF (aero thrust excites surge+pitch+...)

            patches         (float);
            innerDistance   100;
            outerDistance   101;
        }
    }

    restraints
    {
        mooring
        {
            type             moorDynR2;
            body             platformBody;
            couplingMode     "BODY";
            inputFile        "Mooring/lines_oc4.txt";
            bodies           ( platformBody );
            writeMooringVTK  false;
            vtkPrefix        "oc4_overset_pitch";   // unused while VTK off
            vtkStartTime     0;
            outerCorrector   3;
        }


        aero
        {
            type             OpenFast;
            body             platformBody;
            fstFile          "openfast/derisk.fst";
            towerBasePoint   (6.4588 0 10.0293);

            platformReferencePoint (6.3258 0 0.0302);

            initialSurge     6.32582;
            initialSway      0;
            initialHeave     0.03021;
            initialRoll      0;
            initialPitch     0.76184;
            initialYaw       0;

            relaxFactor      0.5;
            useAitken        true;
            verbose          true;
        }
    }
}

// ************************************************************************* //
