cases/06_wave_turbine/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     overWaveDyMFoam;

libs            ( overset fvMotionSolvers "librigidBodyMooring.so" );

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         380;

deltaT          0.002;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      2;

writeFormat     binary;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxAlphaCo      0.25;

maxDeltaT       0.0125;

functions
{
    forces
    {
        type            forces;
        libs            ( forces );
        patches         ( float );
        rhoInf          1025;
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        CofR            ( 6.1468 0 -13.4286 );
    }
    waterVolume
    {
        type            volFieldValue;
        libs            ( fieldFunctionObjects );
        fields          ( alpha.water );
        operation       volIntegrate;
        regionType      all;
        writeControl    timeStep;
        writeInterval   1;
        log             on;
        writeFields     no;
    }
    waterVolumeC1
    {
        type            volFieldValue;
        libs            ( fieldFunctionObjects );
        fields          ( alpha.water );
        operation       volIntegrate;
        regionType      cellZone;
        name            c1Zone;
        writeControl    timeStep;
        writeInterval   1;
        log             off;
        writeFields     no;
    }
    waterFluxInlet
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        regionType      patch;
        name            inlet;
        operation       sum;
        fields          ( phi );
        surfaceFormat   none;
        writeFields     no;
        writeControl    timeStep;
        writeInterval   1;
        log             off;
    }
    waterFluxOutlet
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        regionType      patch;
        name            outlet;
        operation       sum;
        fields          ( phi );
        surfaceFormat   none;
        writeFields     no;
        writeControl    timeStep;
        writeInterval   1;
        log             off;
    }
    UMinMax
    {
        type            fieldMinMax;
        libs            ( fieldFunctionObjects );
        fields          ( U );
        mode            magnitude;
        location        yes;
        writeControl    timeStep;
        writeInterval   1;
        log             on;
    }
    surfaceElevation
    {
        type            surfaceElevation;
        libs            ( "libwaves2FoamSampling.so" );
        writeControl    adjustableRunTime;
        writeInterval   0.1;
        setFormat       raw;
        interpolationScheme cellPoint;
        fields          ( alpha.water );
...
    }
    uProbes
    {
        type            probes;
        libs            ( sampling );
        writeControl    adjustableRunTime;
        writeInterval   0.1;
        fields          ( U );
        probeLocations  ( ( -200 0 -79 ) ( -200 0 -70 ) ( -200 0 -60 ) ( -200 0 -50 ) ( -200 0 -40 ) ( -200 0 -30 ) ( -200 0 -25 ) ( -200 0 -20 ) ( -200 0 -16 ) ( -200 0 -12 ) ( -200 0 -9 ) ( -200 0 -7 ) ( -200 0 -5 ) ( -200 0 -4 ) ( -200 0 -3 ) ( -100 0 -79 ) ( -100 0 -70 ) ( -100 0 -60 ) ( -100 0 -50 ) ( -100 0 -40 ) ( -100 0 -30 ) ( -100 0 -25 ) ( -100 0 -20 ) ( -100 0 -16 ) ( -100 0 -12 ) ( -100 0 -9 ) ( -100 0 -7 ) ( -100 0 -5 ) ( -100 0 -4 ) ( -100 0 -3 ) ( 150 0 -79 ) ( 150 0 -70 ) ( 150 0 -60 ) ( 150 0 -50 ) ( 150 0 -40 ) ( 150 0 -30 ) ( 150 0 -25 ) ( 150 0 -20 ) ( 150 0 -16 ) ( 150 0 -12 ) ( 150 0 -9 ) ( 150 0 -7 ) ( 150 0 -5 ) ( 150 0 -4 ) ( 150 0 -3 ) );
    }
    rigidBodyState
    {
        type            of2RigidBodyStateWriter;
        libs            ( "libOF2.so" );
        writeControl    writeTime;
    }
}


// ************************************************************************* //
