cases/06_wave_turbine/background/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   A nd           | Version:  v2306                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

limitU
{
    type            limitVelocity;
    active          yes;
    selectionMode   all;
    max             8;      // SPDTST: was 10 (dt headroom)
}

// ************************************************************************* //
