cases/06_wave_turbine/background/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

solvers
{
    "cellDisplacement.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }
    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 1;
        cAlpha          1;
        icAlpha         0;
        MULESCorr       yes;
        nLimiterIter    25;
        alphaApplyPrevCorr no;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
        minIter         1;
    }
    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        GaussSeidel;
            tolerance       1e-05;
            relTol          0;
        }
        tolerance       1e-05;
        relTol          0;
    }
    p_rgh
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.05;
    }
    p_rghFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }
    "(U|k|omega).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         1;
        tolerance       1e-07;
        relTol          0.1;
        minIter         1;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors    2;   // SPDTST: was 3
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    moveMeshOuterCorrectors no;    // SPDTST: 1 donor rebuild/step instead of 3
    checkMeshCourantNo no;
    oversetAdjustPhi yes;
    oversetPatchErrOutput no;
    outerCorrectorResidualControl
    {
        p_rgh
        {
            tolerance       5e-05;
            relTol          0;
        }
        "(U|alpha.water)"
        {
            tolerance       1e-06;
            relTol          0;
        }
    }
}

relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}

cache
{
    grad(U)         ;
}


// ************************************************************************* //
