cases/06_wave_turbine/background/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((-97.3 -74.7 27.1));
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     c0;
    }

    {
        name    c1;
        type    cellSet;
        action  invert;
    }
    // c1Zone: cellZone copy of the component cellSet — needed only by the S1
    // static-body gate (dynamicMeshDict_static uses motionSolver solidBody on
    // this zone with zero velocity). Harmless for production.
    {
        name    c1Zone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     c1;
    }
);

// ************************************************************************* //
